IDENTIFICATION DIVISION.
PROGRAM-ID. POLICY-PAYMENT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 POLICY-RECORD.
    05 POLICY-NUMBER PIC X(8).
    05 CURRENT-BALANCE PIC 9(5)V99.
    05 PAYMENT-AMOUNT PIC 9(5)V99.
    05 DISPLAY-BALANCE PIC $ZZZZ9.99.


PROCEDURE DIVISION.
    DISPLAY "ENTER POLICY NUMBER: ".
    ACCEPT POLICY-NUMBER.
    DISPLAY "PLEASE ENTER CURRENT BALANCE: ".
    ACCEPT CURRENT-BALANCE.
    DISPLAY "PLEASE ENTER THE PAYMENT AMOUNT: ".
    ACCEPT PAYMENT-AMOUNT. 

    IF PAYMENT-AMOUNT <= CURRENT-BALANCE
        SUBTRACT PAYMENT-AMOUNT FROM CURRENT-BALANCE
        MOVE CURRENT-BALANCE TO DISPLAY-BALANCE
        DISPLAY "NEW BALANCE: " DISPLAY-BALANCE
    ELSE
        DISPLAY "INSUFFICIENT FUNDS"
    END-IF.

    STOP RUN.