IDENTIFICATION DIVISION.
PROGRAM-ID. POLICY-PAYMENT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 POLICY-RECORD.
    05 POLICY-NUMBER PIC X(8).
    05 CURRENT-BALANCE PIC 9(5).
    05 PAYMENT-AMOUNT PIC 9(5).


PROCEDURE DIVISION.
    DISPLAY "ENTER POLICY NUMBER: ".
    ACCEPT POLICY-NUMBER.
    DISPLAY "PLEASE ENTER CURRENT BALANCE: ".
    ACCEPT CURRENT-BALANCE.
    DISPLAY "PLEASE ENTER THE PAYMENT AMOUNT: ".
    ACCEPT PAYMENT-AMOUNT. 
    STOP RUN.